# git - система контроля версий

# github/gitlab/bitbucket - хранилище/сайт для хранения (версий) кода

# repository/репозиторий - папка, в которой git выслеживает изменения

# git init - создание репозиторий

# git status - проверка статуса отслеживания

# git add <filename> or . - добавление файла в список отслеживания (в staging area)

# git commit -m 'message' - фиксация/создание версии кода с сообщением
# git commit -am 'some message' - добавление файла существуещего файла в список отслеживания и фиксации/создание версии кода

# git remote add <varible_name>(обычно origin) <link to repository> -
#  связка локального репозиторий с удаленным и сохранение ссылка в переменную

# git push origin <branch_name> - отправка версии кода в удаленный репозиторий

# ветка/branch - копия кода независимая от основной версии кода.

# git branch - вывод списка веток 
# git branch <new_branch_name> - создание новой ветки
# git checkout <branch_name> - переход на указанную ветку


# git checkout -b <new_branch_name> - создание новой ветки и переход на указанную ветку
# git merge <branch_name> - склеивание веток. Склеивает указанную ветку к текущей

# git pull origin <branch_name> - стягивание/добавление изменений с указанной ветки в текущую

# git clone <link_to_repository> - скачивание/клонирование указанного репозитория

